In [1]:
#Import the required libraries

import pandas as pd

In [2]:
#Data Structures

#Two types of DataStructures
#1D and 2D

#1D datastructures are also known as SERIES
#2D datastructures are knows as DATAFRAMES

In [6]:
s = pd.Series([0.1, 0.2, 0.3, 0.4])

s

0    0.1
1    0.2
2    0.3
3    0.4
dtype: float64

In [8]:
s[1]

0.2

In [10]:
s[3]

0.4

In [14]:
s2 = pd.Series([1,2,3,4], index=['a', 'b', 'c', 'd'])

s2

a    1
b    2
c    3
d    4
dtype: int64

In [15]:
s2['d']

4

In [16]:
#we can create a series using a dictionary

pop_dict = {'Singapore':5.5,
           'Indonesia':11.5,
           'Italy':15.3,
           'UK':65,
           'Netherlands':17.2}

pop_series = pd.Series(pop_dict)

pop_series

Singapore       5.5
Indonesia      11.5
Italy          15.3
UK             65.0
Netherlands    17.2
dtype: float64

In [17]:
type(pop_series)

pandas.core.series.Series

In [18]:
pop_series['Italy']

15.3

In [19]:
#DATAFRAMES

In [20]:
data = {'country':['Singapore', 'France', 'Germany'],
       'population':[5.5, 64, 82],
       'area':[31000, 672000, 360000],
       'capital':['Singapore','Paris', 'Berlin']}

countries = pd.DataFrame(data)

countries

     country  population    area    capital
0  Singapore         5.5   31000  Singapore
1     France        64.0  672000      Paris
2    Germany        82.0  360000     Berlin

In [21]:
#chnage country column to index

countries = countries.set_index('country')

countries

           population    area    capital
country
Singapore         5.5   31000  Singapore
France           64.0  672000      Paris
Germany          82.0  360000     Berlin

In [22]:
countries['area']

country
Singapore     31000
France       672000
Germany      360000
Name: area, dtype: int64

In [23]:
type(countries['area'])

pandas.core.series.Series

In [24]:
countries

           population    area    capital
country
Singapore         5.5   31000  Singapore
France           64.0  672000      Paris
Germany          82.0  360000     Berlin

In [25]:
#You can perform certain operations on Series and DataFrames

#We want to calculate the population density of all the countries

#pop_density = population/area

countries['population']/countries['area']

country
Singapore    0.000177
France       0.000095
Germany      0.000228
dtype: float64

In [26]:
#I want to get the max area

countries['area'].max()

672000

In [27]:
pop_series

Singapore       5.5
Indonesia      11.5
Italy          15.3
UK             65.0
Netherlands    17.2
dtype: float64

In [30]:
#I want to calculate the population of each country relative to the population of Italy

pop_series / pop_series['Italy']

Singapore      0.359477
Indonesia      0.751634
Italy          1.000000
UK             4.248366
Netherlands    1.124183
dtype: float64

In [31]:
countries

           population    area    capital
country
Singapore         5.5   31000  Singapore
France           64.0  672000      Paris
Germany          82.0  360000     Berlin

In [33]:
#Sort the dataframe on area

countries= countries.sort_values('area', ascending = True)

countries

           population    area    capital
country
Singapore         5.5   31000  Singapore
Germany          82.0  360000     Berlin
France           64.0  672000      Paris

In [34]:
#describe function
countries.describe()

       population           area
count    3.000000       3.000000
mean    50.500000  354333.333333
std     39.996875  320537.569301
min      5.500000   31000.000000
25%     34.750000  195500.000000
50%     64.000000  360000.000000
75%     73.000000  516000.000000
max     82.000000  672000.000000

In [35]:
#Indexing and Slicing of data

countries

           population    area    capital
country
Singapore         5.5   31000  Singapore
Germany          82.0  360000     Berlin
France           64.0  672000      Paris

In [36]:
l1 = ['a','b','c','d']

In [37]:
l1[2]

'c'

In [38]:
l1[-2]

'c'

In [39]:
l1[1:3]

['b', 'c']

In [42]:
countries

           population    area    capital
country
Singapore         5.5   31000  Singapore
Germany          82.0  360000     Berlin
France           64.0  672000      Paris

In [43]:
#I want the population and capital of Singapore to France

#loc - Row location, Column location

countries.loc[ 'Singapore':'France', ['population','capital']]

           population    capital
country
Singapore         5.5  Singapore
Germany          82.0     Berlin
France           64.0      Paris

In [44]:
countries

           population    area    capital
country
Singapore         5.5   31000  Singapore
Germany          82.0  360000     Berlin
France           64.0  672000      Paris

In [46]:
#Select a subset of the data where the area of the country is more than 100000

countries[countries['area']>100000]

         population    area capital
country
Germany        82.0  360000  Berlin
France         64.0  672000   Paris

In [48]:
countries

           population    area    capital
country
Singapore         5.5   31000  Singapore
Germany          82.0  360000     Berlin
France           64.0  672000      Paris

In [49]:
#Task:
#1. Update the population of Singapore to 5.6
#2. Update the capital of Singapore to Singapore City

countries.loc['Singapore', 'population'] = 5.6

countries

           population    area    capital
country
Singapore         5.6   31000  Singapore
Germany          82.0  360000     Berlin
France           64.0  672000      Paris

In [50]:
countries.loc[ 'Singapore','capital' ] = 'Singapore City'

In [51]:
countries

           population    area         capital
country
Singapore         5.6   31000  Singapore City
Germany          82.0  360000          Berlin
France           64.0  672000           Paris

In [52]:
#I want to add a new column to the countries dataframe
#The new column is population_density, pop_density = population/area

countries['pop_density'] = countries['population']/countries['area']

countries

           population    area         capital  pop_density
country
Singapore         5.6   31000  Singapore City     0.000181
Germany          82.0  360000          Berlin     0.000228
France           64.0  672000           Paris     0.000095

In [53]:
#rename population to pop

countries = countries.rename(columns={'population':'pop'})

countries

            pop    area         capital  pop_density
country
Singapore   5.6   31000  Singapore City     0.000181
Germany    82.0  360000          Berlin     0.000228
France     64.0  672000           Paris     0.000095

##### The End